# WallDesignThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralR..::..WallDesignThickness Property
StructuralSectionGeneralR Class See Also
---
Represents wall design thickness of rectangle.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double WallDesignThickness { get; set; }
```

Visual Basic
---
```text
Public Property WallDesignThickness As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WallDesignThickness {
	double get ();
	void set (double value);
}
```

# Remarks
Design thickness of pipe wall is value should be thinner value than measured real value (nominal). In EN standard it is marked as "d". //Need to be verified!!!!!!! In ACI standard it is marked as "d". //Need to be verified!!!!!!!
# See Also
StructuralSectionGeneralR Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace